wiki/diagrams/synthesis-reddit-ads-diagram-2.dot
digraph G {
    rankdir=LR;
    node [fontsize=11];
    edge [fontsize=10, arrowhead=normal];
    TL [label="Targeting Layer", shape=box];
    LR [label="Light Rankers", shape=box];
    TL -> LR;
    HR [label="Heavy Rankers", shape=box];
    LR -> HR;
    AU [label="Auction", shape=box];
    HR -> AU;
    AS [label="Ad Selected", shape=box];
    AU -> AS;
}
